---
kind: type
id: T:Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening
source: html/825025c8-342d-46b7-592e-e42d8f8e8336.htm
---
# Autodesk.Revit.DB.Analysis.EnergyAnalysisOpening

Analytical opening.

## Syntax (C#)
```csharp
public class EnergyAnalysisOpening : Element
```